#include <iostream>
#include <string>
#include <vector>
#include <random>
#include <Windows.h>

#define CARDS_SIZE 52	// 카드 갯수 (a~10, J, Q, K)
#define CARD_SIZE 13	// 카드 종류별 갯수

using namespace std;

// 카드 모양 열거형
enum CardShape
{
	E_HEART = 0,	// 하트 시작 인덱스
	E_CLOVER = 13,	// 클로버 시작 인덱스
	E_DIAMOND = 26,	// 다이아몬드 시작 인덱스
	E_SPADE = 39,	// 스페이드 시작 인덱스
};

// 카드 구조체
struct Card
{
	string UI;	// 카드 UI
	int num;	// 증가값
};

// 카드 UI
static const Card g_CardUI[CARDS_SIZE] = {
		{",__________,\n|A         |\n|          |\n|          |\n|          |\n|    ♥    |\n|          |\n|          |\n|          |\n|         A|\n'----------'\n", 11},
		{",__________,\n|2         |\n|          |\n|    ♥    |\n|          |\n|          |\n|          |\n|    ♥    |\n|          |\n|         2|\n'----------'\n", 2},
		{",__________,\n|3         |\n|          |\n|    ♥    |\n|          |\n|    ♥    |\n|          |\n|    ♥    |\n|          |\n|         3|\n'----------'\n", 3},
		{",__________,\n|4         |\n|          |\n|  ♥  ♥  |\n|          |\n|          |\n|          |\n|  ♥  ♥  |\n|          |\n|         4|\n'----------'\n", 4},
		{",__________,\n|5         |\n|          |\n|  ♥  ♥  |\n|          |\n|    ♥    |\n|          |\n|  ♥  ♥  |\n|          |\n|         5|\n'----------'\n", 5},
		{",__________,\n|6         |\n|          |\n|  ♥  ♥  |\n|          |\n|  ♥  ♥  |\n|          |\n|  ♥  ♥  |\n|          |\n|         6|\n'----------'\n", 6},
		{",__________,\n|7         |\n|          |\n|  ♥  ♥  |\n|    ♥    |\n|  ♥  ♥  |\n|          |\n|  ♥  ♥  |\n|          |\n|         7|\n'----------'\n", 7},
		{",__________,\n|8         |\n|          |\n|  ♥  ♥  |\n|    ♥    |\n|  ♥  ♥  |\n|    ♥    |\n|  ♥  ♥  |\n|          |\n|         8|\n'----------'\n", 8},
		{",__________,\n|9         |\n|  ♥  ♥  |\n|          |\n|  ♥  ♥  |\n|    ♥    |\n|  ♥  ♥  |\n|          |\n|  ♥  ♥  |\n|         9|\n'----------'\n", 9},
		{",__________,\n|10        |\n|  ♥  ♥  |\n|    ♥    |\n|  ♥  ♥  |\n|          |\n|  ♥  ♥  |\n|    ♥    |\n|  ♥  ♥  |\n|        10|\n'----------'\n", 10},
		{",__________,\n|J         |\n|          |\n|          |\n|          |\n|    ♥    |\n|          |\n|          |\n|          |\n|         J|\n'----------'\n", 10},
		{",__________,\n|Q         |\n|          |\n|          |\n|          |\n|    ♥    |\n|          |\n|          |\n|          |\n|         Q|\n'----------'\n", 10},
		{",__________,\n|K         |\n|          |\n|          |\n|          |\n|    ♥    |\n|          |\n|          |\n|          |\n|         K|\n'----------'\n", 10},
		{",__________,\n|A         |\n|          |\n|          |\n|          |\n|    ♣    |\n|          |\n|          |\n|          |\n|         A|\n'----------'\n", 11},
		{",__________,\n|2         |\n|          |\n|    ♣    |\n|          |\n|          |\n|          |\n|    ♣    |\n|          |\n|         2|\n'----------'\n", 2},
		{",__________,\n|3         |\n|          |\n|    ♣    |\n|          |\n|    ♣    |\n|          |\n|    ♣    |\n|          |\n|         3|\n'----------'\n", 3},
		{",__________,\n|4         |\n|          |\n|  ♣  ♣  |\n|          |\n|          |\n|          |\n|  ♣  ♣  |\n|          |\n|         4|\n'----------'\n", 4},
		{",__________,\n|5         |\n|          |\n|  ♣  ♣  |\n|          |\n|    ♣    |\n|          |\n|  ♣  ♣  |\n|          |\n|         5|\n'----------'\n", 5},
		{",__________,\n|6         |\n|          |\n|  ♣  ♣  |\n|          |\n|  ♣  ♣  |\n|          |\n|  ♣  ♣  |\n|          |\n|         6|\n'----------'\n", 6},
		{",__________,\n|7         |\n|          |\n|  ♣  ♣  |\n|    ♣    |\n|  ♣  ♣  |\n|          |\n|  ♣  ♣  |\n|          |\n|         7|\n'----------'\n", 7},
		{",__________,\n|8         |\n|          |\n|  ♣  ♣  |\n|    ♣    |\n|  ♣  ♣  |\n|    ♣    |\n|  ♣  ♣  |\n|          |\n|         8|\n'----------'\n", 8},
		{",__________,\n|9         |\n|  ♣  ♣  |\n|          |\n|  ♣  ♣  |\n|    ♣    |\n|  ♣  ♣  |\n|          |\n|  ♣  ♣  |\n|         9|\n'----------'\n", 9},
		{",__________,\n|10        |\n|  ♣  ♣  |\n|    ♣    |\n|  ♣  ♣  |\n|          |\n|  ♣  ♣  |\n|    ♣    |\n|  ♣  ♣  |\n|        10|\n'----------'\n", 10},
		{",__________,\n|J         |\n|          |\n|          |\n|          |\n|    ♣    |\n|          |\n|          |\n|          |\n|         J|\n'----------'\n", 10},
		{",__________,\n|Q         |\n|          |\n|          |\n|          |\n|    ♣    |\n|          |\n|          |\n|          |\n|         Q|\n'----------'\n", 10},
		{",__________,\n|K         |\n|          |\n|          |\n|          |\n|    ♣    |\n|          |\n|          |\n|          |\n|         K|\n'----------'\n", 10},
		{",__________,\n|A         |\n|          |\n|          |\n|          |\n|    ◆    |\n|          |\n|          |\n|          |\n|         A|\n'----------'\n", 11},
		{",__________,\n|2         |\n|          |\n|    ◆    |\n|          |\n|          |\n|          |\n|    ◆    |\n|          |\n|         2|\n'----------'\n", 2},
		{",__________,\n|3         |\n|          |\n|    ◆    |\n|          |\n|    ◆    |\n|          |\n|    ◆    |\n|          |\n|         3|\n'----------'\n", 3},
		{",__________,\n|4         |\n|          |\n|  ◆  ◆  |\n|          |\n|          |\n|          |\n|  ◆  ◆  |\n|          |\n|         4|\n'----------'\n", 4},
		{",__________,\n|5         |\n|          |\n|  ◆  ◆  |\n|          |\n|    ◆    |\n|          |\n|  ◆  ◆  |\n|          |\n|         5|\n'----------'\n", 5},
		{",__________,\n|6         |\n|          |\n|  ◆  ◆  |\n|          |\n|  ◆  ◆  |\n|          |\n|  ◆  ◆  |\n|          |\n|         6|\n'----------'\n", 6},
		{",__________,\n|7         |\n|          |\n|  ◆  ◆  |\n|    ◆    |\n|  ◆  ◆  |\n|          |\n|  ◆  ◆  |\n|          |\n|         7|\n'----------'\n", 7},
		{",__________,\n|8         |\n|          |\n|  ◆  ◆  |\n|    ◆    |\n|  ◆  ◆  |\n|    ◆    |\n|  ◆  ◆  |\n|          |\n|         8|\n'----------'\n", 8},
		{",__________,\n|9         |\n|  ◆  ◆  |\n|          |\n|  ◆  ◆  |\n|    ◆    |\n|  ◆  ◆  |\n|          |\n|  ◆  ◆  |\n|         9|\n'----------'\n", 9},
		{",__________,\n|10        |\n|  ◆  ◆  |\n|    ◆    |\n|  ◆  ◆  |\n|          |\n|  ◆  ◆  |\n|    ◆    |\n|  ◆  ◆  |\n|        10|\n'----------'\n", 10},
		{",__________,\n|J         |\n|          |\n|          |\n|          |\n|    ◆    |\n|          |\n|          |\n|          |\n|         J|\n'----------'\n", 10},
		{",__________,\n|Q         |\n|          |\n|          |\n|          |\n|    ◆    |\n|          |\n|          |\n|          |\n|         Q|\n'----------'\n", 10},
		{",__________,\n|K         |\n|          |\n|          |\n|          |\n|    ◆    |\n|          |\n|          |\n|          |\n|         K|\n'----------'\n", 10},
		{",__________,\n|A         |\n|          |\n|          |\n|          |\n|    ♠    |\n|          |\n|          |\n|          |\n|         A|\n'----------'\n", 11},
		{",__________,\n|2         |\n|          |\n|    ♠    |\n|          |\n|          |\n|          |\n|    ♠    |\n|          |\n|         2|\n'----------'\n", 2},
		{",__________,\n|3         |\n|          |\n|    ♠    |\n|          |\n|    ♠    |\n|          |\n|    ♠    |\n|          |\n|         3|\n'----------'\n", 3},
		{",__________,\n|4         |\n|          |\n|  ♠  ♠  |\n|          |\n|          |\n|          |\n|  ♠  ♠  |\n|          |\n|         4|\n'----------'\n", 4},
		{",__________,\n|5         |\n|          |\n|  ♠  ♠  |\n|          |\n|    ♠    |\n|          |\n|  ♠  ♠  |\n|          |\n|         5|\n'----------'\n", 5},
		{",__________,\n|6         |\n|          |\n|  ♠  ♠  |\n|          |\n|  ♠  ♠  |\n|          |\n|  ♠  ♠  |\n|          |\n|         6|\n'----------'\n", 6},
		{",__________,\n|7         |\n|          |\n|  ♠  ♠  |\n|    ♠    |\n|  ♠  ♠  |\n|          |\n|  ♠  ♠  |\n|          |\n|         7|\n'----------'\n", 7},
		{",__________,\n|8         |\n|          |\n|  ♠  ♠  |\n|    ♠    |\n|  ♠  ♠  |\n|    ♠    |\n|  ♠  ♠  |\n|          |\n|         8|\n'----------'\n", 8},
		{",__________,\n|9         |\n|  ♠  ♠  |\n|          |\n|  ♠  ♠  |\n|    ♠    |\n|  ♠  ♠  |\n|          |\n|  ♠  ♠  |\n|         9|\n'----------'\n", 9},
		{",__________,\n|10        |\n|  ♠  ♠  |\n|    ♠    |\n|  ♠  ♠  |\n|          |\n|  ♠  ♠  |\n|    ♠    |\n|  ♠  ♠  |\n|        10|\n'----------'\n", 10},
		{",__________,\n|J         |\n|          |\n|          |\n|          |\n|    ♠    |\n|          |\n|          |\n|          |\n|         J|\n'----------'\n", 10},
		{",__________,\n|Q         |\n|          |\n|          |\n|          |\n|    ♠    |\n|          |\n|          |\n|          |\n|         Q|\n'----------'\n", 10},
	{",__________,\n|K         |\n|          |\n|          |\n|          |\n|    ♠    |\n|          |\n|          |\n|          |\n|         K|\n'----------'\n", 10},
};

// 랜덤 번호 배열
static const int nums[CARDS_SIZE] = {
	15, 2, 49, 33, 47, 24, 51, 41, 18, 5,
	3, 30, 9, 50, 34, 12, 44, 4, 31, 38,
	10, 27, 28, 45, 19, 43, 8, 13, 7, 11,
	32, 21, 37, 29, 6, 48, 1, 20, 36, 26,
	25, 40, 14, 16, 52, 22, 35, 23, 46, 42,
	17, 39
};

vector<int> g_CardQueue;		// 랜덤 카드 큐
int front = -1, rear = -1;

// 초기 카드 세팅
void InitCard(vector<int>* cardArr, int* sum)
{
	for (int i = 0; i < 2; i++)
	{
		++front;
		cardArr->push_back(g_CardQueue[front]);
		*sum += g_CardUI[g_CardQueue[front]].num;		// 카드 점수 누적

		// TODO: 출력
		cout << g_CardUI[g_CardQueue[front]].UI << "sum: " << *sum << endl;
	}
}

// 힛: 카드 뽑기
void Hit(vector<int>* p_cardArr, int* p_sum)
{
	cout << endl << "<Hit!>" << endl;

	++front;
	p_cardArr->push_back(g_CardQueue[front]);
	*p_sum = g_CardQueue[front];

	cout << g_CardUI[g_CardQueue[front]].UI << "sum: " << *p_sum << endl;
}

// 스테이: 카드 뽑기 중지
void Stay()
{

}

void ShowMessage(string message)
{
	system("cls");
	cout << message << endl;
	Sleep(1000);
}

int main()
{
	// 랜덤
	random_device rd;
	mt19937 gen(rd());
	uniform_int_distribution<int> random(1, CARDS_SIZE);

	// 큐 자료구조 사용
	vector<int> AI_card;		// 딜러 카드 배열
	int AI_sum = 0;				// 딜러 카드 합계
	vector<int> player_card;	// 플레이어 카드 배열
	int player_sum = 0;			// 플레이어 카드 합계


	// 카드 랜덤 섞기 (중복 있음)
	// TODO: 중복 제거 처리
	for (int i = 0; i < CARDS_SIZE; i++)
	{
		g_CardQueue.push_back(nums[random(rd)]);
		++rear;
	}
	
	// 카드를 딜러(AI), 플레이어에게 2장씩 나눠주기
	cout << "<딜러 덱>" << endl;
	InitCard(&AI_card, &AI_sum);			// AI 카드 세팅
	cout << endl << "<플레이어 덱>" << endl;
	InitCard(&player_card, &player_sum);	// 플레이어 카드 세팅
	
	// 딜러의 카드 숫자가 16 이하일 경우 카드를 뽑음 (17 이상일 경우 스테이)
	// 뽑다가 카드가 21이 되었을 경우 플레이어 승리
	while (true)
	{
		if (AI_sum > 21)
		{
			for (int i : AI_card)
			{
				// 카드가 A일 경우
				if (i % CARD_SIZE == 0)
				{
					cout << i << endl;
					AI_sum -= 10;	// 1로 변경
				}
				else
				{
					ShowMessage("딜러가 21을 초과했습니다. 당신의 승리!");
					return 0;
				}
			}
		}

		// 딜러 카드 합계가 17일 넘을 경우 카드 세팅 종료
		if (AI_sum >= 17) break;

		Hit(&AI_card, &AI_sum);
	}
	
	return 0;
}